Autodesk.Revit.DB.ElementType.IsValidDefaultFamilyType(Autodesk.Revit.DB.ElementId)
Identifies if this type is a valid default family type for the given family category id.
familyCategoryId:
The family category id.
Returns:
True if this type is a valid default family type for the given family category id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ElementType.Duplicate(System.String)
Duplicates an existing element type and assigns it a new name.
name:
The new name of the element type.
Returns:
The duplicated element type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
name cannot include prohibited characters.
-or-
The element type name was empty, contained invalid characters, or was invalid for the specific element type.
-or-
The name is already in use for this element type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The ElementType cannot be copied.

Autodesk.Revit.DB.ElementType.GetSimilarTypes
Obtains a set of types that are similar to this type.
Remarks:
Two types are similar if elements that have one type could be assigned the other type.
Returns:
A set of element IDs of types that are similar to this type.
Since:
2011

Autodesk.Revit.DB.ElementType.IsSimilarType(Autodesk.Revit.DB.ElementId)
Checks if given type is similar to this type.
Remarks:
Two types are similar if elements that have one type could be assigned the other type.
typeId:
ElementId of the type to check.
Returns:
True if given type is similar to this type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ElementType.FamilyName
Gets the family name of this element type.
Remarks:
This value is a localized string describing the family in which this ElementType
belongs. For family symbols, this will be the name of the associated Family.
For system family types, this will be the name used to group related types,
such as "Oval Duct" or "Curtain Wall".
Since:
2015

Autodesk.Revit.DB.ElementType.CanBeDeleted
Determine if this ElementType can be deleted
Since:
2015

Autodesk.Revit.DB.ElementType.CanBeRenamed
Determine if this ElementType can be renamed
Since:
2015

Autodesk.Revit.DB.ElementType.CanBeCopied
Determine if this ElementType can create a copy
Since:
2015

Autodesk.Revit.DB.ElementType.GetPreviewImage(System.Drawing.Size)
Get the preview image of an element. This image is similar to what is seen in the Revit UI when selecting the type of an element.
size: The width and height of the preview image in pixels.
Returns: System::Drawing::Bitmap represents the preview image. null if there is no preview image.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The width or height of the size is equal or less than zero.
Since: 2011

Autodesk.Revit.DB.ElementType.Name
Set the name for the ElementType.
Remarks: This method will assign the element type a new name.

Autodesk.Revit.DB.ElementType
Base class for all Types within Autodesk Revit.
Remarks:
Element types are usually non user visible elements that define instances. For example a
wall type is a type that is not visible until an instance of the wall is created.